Revit 2026 API

# WallPaintWallpaintColor Property

---

The property labeled "Color" from the "WallPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WallpaintColor { get; }
```
```vb
Public Shared ReadOnly Property WallpaintColor As String
	Get
```
```cpp
public:
static property String^ WallpaintColor {
	String^ get ();
}
```
```fsharp
static member WallpaintColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

WallPaint Class

Autodesk.Revit.DB.Visual Namespace